Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/moving_country/moving_to_ireland/introduction_to_the_irish_system/moving_your_child_irish_secondary_school.html.txt.tmx
Source language: en
Languages: ga

source: Moving your children to secondary school
ga: Do pháisté a aistriú chuig meánscoil Éireannach

source: The Irish secondary (also known as post-primary) school cycle is generally 5 or 6 years long
ga: De ghnáth tá an timthiall meánscolaíochta (ar a dtugtar iarscoile freisin) 5 nó 6 bhliana ar a fhad in Éirinn

source: Children begin their secondary school studies around the age of 12 and leave around the age of 17 or 18, having taken 2 State exams in that period
ga: Tosnaíonn páistí sa mheánscoil thart ar dhá bhliain déag d'aois agus críochnaíonn siad ag 17 nó 18, tar éis dóibh 2 scrúdú Stáit a dhéanamh sa tréimhse sin

source: The minimum school leaving age is 16 years or the completion of 3 years of post-primary education, whichever is the later
ga: Is an íosaois fágála scoile é 16 bliana nó críochnú 3 bliana oideachais iar-bhunscoile, pé ceann is deireanaí

source: Most schools offer students the option of a Transition Year after they have completed the first 3 years of secondary education
ga: Baineann cuid de na scoileanna deis as an Idirbhliain le sos a thabhairt do na mic léinn ó na scrúduithe Stáit tar éis dóibh an chéad 3 bhliain a chur i gcrích

source: This allows students to explore non-academic interests, whether they are social, creative or linked to the world of business
ga: Tugann seo seans don mhac léinn breathnú ar na hábhair eile neamh-acadúla, bíodh siad sóisialta, cruthaitheacha nó bainteach le saol an ghnó

source: At the end of the first 3 years students sit the Junior Certificate examination and after that they may choose from 3 different Leaving Certificate programmes
ga: Ag deireadh an chéad 3 bhliain oideachais meánscolaíochta, déanann na mic léinn an scrúdú Teastais Sóisearach agus ansin tá 3 chlár don Ardteistiméireacht gur féidir leis na mic léinn a rogha ceann a phiocadh

source: They can take the traditional (established) Leaving Certificate or they can choose from the Leaving Certificate Vocational Programme or the Leaving Certificate Applied Programme, both of which focus on a student's more practical and technical abilities
ga: Is féidir leo an Ardteistiméireacht (bunaithe) traidisiúnta a dhéanamh nó is féidir leo an Clár Gairmiúil don Ardteistiméireacht nó an Ardteistiméireacht Fheidhmeach a roghnú. Cuireann an dá chlár sin béim ar chumas praiticiúil nó teicniúil an mhic léinn

source: More information on secondary education is in our document, Starting post-primary school
ga: Tá tuilleadh faisnéise faoi oideachas meánscolaíochta inár ndoiciméad, Tosú ar iar-bhunscoil

source: The Irish secondary school year stretches from the first week in September to the first week in June
ga: Tosaíonn an bhliain scoile don dara leibhéal ón gcéad seachtain i Meán Fómhair go dtí an chéad seachtain sa Mheitheamh

source: If your child is going into a Junior Certificate Class or a Leaving Certificate class, however, they will not finish until later in June, as they will be taking their exams at that time
ga: Má tá do pháiste ag dul isteach i rang an Teastais Shóisearaigh nó i rang na hArdteistiméireachta ní chríochnóidh sé/sí go dtí deireadh an Mheithimh mar beidh na scrúduithe le déanamh ag an am sin

source: The types of schools available
ga: Na cineálacha scoileanna atá ar fáil

source: The post-primary school system includes secondary schools, vocational schools, community or comprehensive schools and fee-paying secondary schools
ga: Meánscoileanna, scoileanna gairmoideachais, scoileanna pobail agus cuimsitheacha agus scoileanna táillí iad na scoileanna dara leibhéil

source: The majority of Irish children go to secondary schools, which are privately owned and managed and often run by religious orders, although the teachers in these schools are generally lay staff
ga: Bíonn formhór páistí na hÉireann ag freastal ar meánscoileanna a bhfuil úinéirí príobháideacha acu agus atá dhá bhainistiú agus rite ag oird rialta, ach is iondúil gur múinteoirí tuata iad an fhoireann

source: The majority of secondary schools are free, but there are also fee-paying schools
ga: Níl aon táillí le híoc le formhór na meánscoileanna ach tá cuid mhaith scoileanna príobháideacha gur gá táillí a íoc leo freisin ann

source: Vocational schools and community or comprehensive schools are all free
ga: Níl aon táillí le híoc le gairmscoileanna ná le scoileanna pobail agus cuimsitheacha

source: These schools tend to provide both academic and technical education and they often provide additional further education opportunities for school-leavers and adults in the local community
ga: Cuireann na scoileanna seo oideachas acadúil agus teicniúil ar fáil agus go minic bíonn siad ag cur oideachais bhreise ar fáil do dhaoine atá ag fágáil na scoile agus do dhaoine fásta sa phobal áitiúil

source: There are a small number of private international schools in Ireland including a French school, a Japanese school and a German school
ga: Tá roinnt bheag scoileanna idirnáisiúnta príobháideacha in Éirinn ina measc scoil Fhrancach, scoil Sheapánach agus scoil Ghearmánach

source: Choosing a school and enrolling your child
ga: Scoil a roghnú agus do pháiste a chlárú

source: You can get a list of Irish schools on a county-by-county basis from the Department of Education and Skills
ga: Is féidir liosta scoileanna na hÉireann de réir contae a fháil ón Roinn Oideachais agus Scileanna

source: You should gather as much information as possible about the schools in which you are interested
ga: Ba cheart duit an oiread eolais agus is féidir leat a fháil faoi na scoileanna a bhfuil spéis agat iontu

source: Schools can vary quite considerably in the ways in which they operate and the emphasis they put on areas such as exams, sports, the arts, personal development, religion, social affairs, European languages and practical skills acquisition
ga: Is féidir difríochtaí móra a bheith idir scoileanna ina modhanna oibre agus sa bhéim a leagann siad ar scrúduithe, spóirt, ealaín, forbairt phearsanta, creideamh, gnóthaí sóisialta, teangacha na hEorpa, scileanna praiticiúla

source: Talk to teachers and, if possible, to other parents in order to see whether the school is likely to meet the needs of your particular child
ga: Labhair le múinteoirí agus más féidir le tuismitheoirí eile le breathnú an bhfuil an scoil le bheith feiliúnach do na riachtanais atá ag do pháiste

source: Some schools will have a waiting list
ga: Beidh liosta feithimh ag roinnt scoileanna

source: You will need to investigate the enrolment policy of the school in which you are interested and in general you should plan the enrolment of your child well in advance
ga: Ní mór duit an polasaí iontrála atá ag an scoil a fhiosrú agus d'fhéadfadh sé a bheith riachtanach go ndéanfaidh tú clárú do pháiste i do rogha scoil a phleanáil cuid mhaith roimh an am

source: If you are planning to remain abroad and to send your child to an Irish school as an overseas student, you can choose from a range of fee-paying secondary schools (such as a boarding school or a day secondary school) that arrange accommodation and guardianship, as appropriate
ga: Má tá sé i gceist agat féin fanacht thar lear agus do pháiste a chur chuig scoil Éireannach mar mhac léinn ón iasacht, is féidir leat rogha a dhéanamh idir réimse meánscoileanna táillí (mar shampla, scoil chónaithe nó meánscoil lae) a dhéanann socruithe maidir le lóistín baile agus caomhnú mar is cuí

source: If your child wishes to go to university or another third-level institution, they will need to score enough points in their Leaving Certificate exams
ga: Más mian le do pháiste freastal ar ollscoil nó ar institiúid thríú leibhéil eile, is gá dó/dí dóthain pointí a fháil i scrúdú na hArdteistiméireachta

source: They will receive points for the 6 best grades they receive with the highest points going to an A1 in a paper at Honours level
ga: Tá pointí ar fáil don 6 ghrád is fearr a fhaigheann mac léinn agus na pointí is airde ar fáil don ghrád A1 i scrúdú ag an Ard leibhéal

source: Most students take 7 subjects in the Leaving Certificate
ga: Go hiondúil déanann na mic léinn staidéar ar 7 n-ábhar san Ardteistiméireacht

source: The points they need for third-level courses will depend on the subject they wish to study
ga: Braitheann na pointí a theastaíonn don tríú leibhéal ar an ábhar staidéir a roghnaíonn an mac léinn

source: More information on going to third-level education is in our document, Application procedures and entry requirements
ga: Tá tuilleadh faisnéise faoi oideachas tríú leibhéil inár ndoiciméad, Córas iarratais agus riachtanais iontrála coláistí

source: Education in State-funded second-level schools is free
ga: Tá an t-oideachas na meánscoileanna maoinithe ag an Stát saor in aisce

source: The costs of fee-paying secondary schools can vary considerably
ga: Bíonn an-difríocht idir na táillí a ghearrann meánscoileanna táillí

source: You will need to check with each individual school
ga: Ní mór an cás a phlé leis an scoil atá i gceist

source: Whatever school you choose, you will need to pay for school books and, where appropriate, school uniforms
ga: Pé scoil a roghnaíonn tú, beidh ort leabhair scoile a cheannach agus culaith éadaigh nuair is gá a cheannach freisin

source: Usually, you will also have to pay for extra-curricular activities
ga: Go hiondúil bíonn táille le híoc ar aon imeachtaí taobh amuigh den ghnáthchuraclam

source: Apply directly to the school in which you are interested, as early as possible and ask about their enrolment policy
ga: Cuir iarratas díreach chuig an scoil a bhfuil spéis agat inti, go maith in am roimh thús na scoilbhliana ach faigh cóip den pholasaí iontrála atá ag an scoil

source: Some schools may ask your child to sit an entrance exam, for which they will charge a fee
ga: Bíonn scrúdú iontrála ag roinnt scoileanna don pháiste agus beidh táille le n-íoc don scrúdú seo a dhéanamh
